### 시간 조작
- 시계열 시간 조작 단위는 '년, 월, 일, 시, 분, 초'

In [21]:
import pandas as pd

# 시간 정의
dates=['2020-01-01','2020-03-01','2021-09-01']
dates

# 시간 자료형 생성
ts_dates=pd.to_datetime(dates)
ts_dates

# Timestamp를 Period로 변환
pr_day=ts_dates.to_period(freq='D')  # 1일 기간
pr_day
pr_month=ts_dates.to_period(freq='M')  # 1개월 기간
pr_month
pr_year=ts_dates.to_period(freq='A')  # 1년 기간
pr_year

PeriodIndex(['2020', '2020', '2021'], dtype='period[A-DEC]')

- 시계열 객체로 변환: pd.to_datetime()

In [22]:
file_path='C:/python_data/7장데이터/timeseries.csv'
df=pd.read_csv(file_path)
df

         Date  Close  Start   High    Low  Volume
0  2015-07-02  10100  10850  10900  10000  137977
1  2016-06-29  10700  10550  10900   9990  170253
2  2017-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2019-06-26  10800  10900  11000  10700   63039

In [23]:
df.info()  # 현재 날짜를 나타내는 Date 컬럼이 문자형(object)이므로 to_datetime() 함수를 이용해서 Date 컬럼을 시계열 객체(Timestamp)로 변환 후 확인

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    5 non-null      object
 1   Close   5 non-null      int64
 2   Start   5 non-null      int64
 3   High    5 non-null      int64
 4   Low     5 non-null      int64
 5   Volume  5 non-null      int64
dtypes: int64(5), object(1)
memory usage: 368.0+ bytes

In [24]:
df['new_Date']=ㅔ=pd.to_datetime(df['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      5 non-null      object
 1   Close     5 non-null      int64
 2   Start     5 non-null      int64
 3   High      5 non-null      int64
 4   Low       5 non-null      int64
 5   Volume    5 non-null      int64
 6   new_Date  5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 408.0+ bytes

In [25]:
# 기존 Date 열을 삭제
df.drop('Date',axis=1,inplace=True)
df

   Close  Start   High    Low  Volume   new_Date
0  10100  10850  10900  10000  137977 2015-07-02
1  10700  10550  10900   9990  170253 2016-06-29
2  10400  10900  10950  10150  155769 2017-06-28
3  10900  10800  11050  10500  133548 2018-06-27
4  10800  10900  11000  10700   63039 2019-06-26

In [26]:
# new_Date를 인덱스로 지정
df.set_index('new_Date',inplace=True)
df

            Close  Start   High    Low  Volume
new_Date
2015-07-02  10100  10850  10900  10000  137977
2016-06-29  10700  10550  10900   9990  170253
2017-06-28  10400  10900  10950  10150  155769
2018-06-27  10900  10800  11050  10500  133548
2019-06-26  10800  10900  11000  10700   63039

In [27]:
# 간단한 시계열 시각화
import matplotlib
df.plot  # 왜 이미지가 안 뜨지

### 기간 함수
- date_range()
- period_range()

In [41]:
import pandas as pd

file_path='C:/python_data/7장데이터/timeseries.csv'
df=pd.read_csv(file_path)
df

df['new_Date']=pd.to_datetime(df['Date'])
df

         Date  Close  Start   High    Low  Volume   new_Date
0  2015-07-02  10100  10850  10900  10000  137977 2015-07-02
1  2016-06-29  10700  10550  10900   9990  170253 2016-06-29
2  2017-06-28  10400  10900  10950  10150  155769 2017-06-28
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27
4  2019-06-26  10800  10900  11000  10700   63039 2019-06-26

In [42]:
import numpy as np

dates=pd.date_range('20200101',periods=6)  # range 와 비슷
dates

df_range=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list("ABCD"))  # np.random.randn 가우시안 표준 정규 분포에서 난수 matirx array 생성
df_range

                   A         B         C         D
2020-01-01  0.691846  0.501942 -0.188562 -1.224283
2020-01-02 -0.638815 -0.414558 -2.129896 -1.349891
2020-01-03 -0.005926 -0.011385  0.717918 -1.862838
2020-01-04  0.069822  0.510178  0.154875  0.340857
2020-01-05  1.513757  0.572175  0.753668 -0.749978
2020-01-06 -0.699613  0.927986  1.304280 -0.276055

In [43]:
# 시계열 활용 날짜 데이터 분리: dt.year, dt.month, dt.day
df['year']=df['new_Date'].dt.year
df['month']=df['new_Date'].dt.month
df['day']=df['new_Date'].dt.day
df

         Date  Close  Start   High    Low  Volume   new_Date  year  month  day
0  2015-07-02  10100  10850  10900  10000  137977 2015-07-02  2015      7    2
1  2016-06-29  10700  10550  10900   9990  170253 2016-06-29  2016      6   29
2  2017-06-28  10400  10900  10950  10150  155769 2017-06-28  2017      6   28
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  2019-06-26  10800  10900  11000  10700   63039 2019-06-26  2019      6   26

In [44]:
# period 함수를 이용해 표기 변경
df['Date_yr']=df['new_Date'].dt.to_period(freq='A')  # 년도까지
df['Date_m']=df['new_Date'].dt.to_period(freq='M')  # 년월까지
df.set_index('new_Date',inplace=True)  # 날짜 인덱스 지정
df

,Date,Close,Start,High,Low,Volume,year,month,day,Date_yr,Date_m
new_Date,,,,,,,,,,,
2015-07-02,2015-07-02,10100,10850,10900,10000,137977,2015,7,2,2015,2015-07
2016-06-29,2016-06-29,10700,10550,10900,9990,170253,2016,6,29,2016,2016-06
2017-06-28,2017-06-28,10400,10900,10950,10150,155769,2017,6,28,2017,2017-06
2018-06-27,2018-06-27,10900,10800,11050,10500,133548,2018,6,27,2018,2018-06
2019-06-26,2019-06-26,10800,10900,11000,10700,63039,2019,6,26,2019,2019-06

In [46]:
df.loc['2015-07']  # 이렇게 이용가능
df.loc['2015-06-25' : '2018-06-20']  # 해당 기간 인덱싱

,Date,Close,Start,High,Low,Volume,year,month,day,Date_yr,Date_m
new_Date,,,,,,,,,,,
2015-07-02,2015-07-02,10100,10850,10900,10000,137977,2015,7,2,2015,2015-07
2016-06-29,2016-06-29,10700,10550,10900,9990,170253,2016,6,29,2016,2016-06
2017-06-28,2017-06-28,10400,10900,10950,10150,155769,2017,6,28,2017,2017-06

In [47]:
# 오늘 날짜와의 차이를 계산하는 컬럼 추가
today=pd.to_datetime('2020-03-18')
df['time_diff']=today - df.index  # today를 특정 날짜로 정해놓고, index로 정한 날짜와의 차이를 보여주는 것
df

,Date,Close,Start,High,Low,Volume,year,month,day,Date_yr,Date_m,time_diff
new_Date,,,,,,,,,,,,
2015-07-02,2015-07-02,10100,10850,10900,10000,137977,2015,7,2,2015,2015-07,1721 days
2016-06-29,2016-06-29,10700,10550,10900,9990,170253,2016,6,29,2016,2016-06,1358 days
2017-06-28,2017-06-28,10400,10900,10950,10150,155769,2017,6,28,2017,2017-06,994 days
2018-06-27,2018-06-27,10900,10800,11050,10500,133548,2018,6,27,2018,2018-06,630 days
2019-06-26,2019-06-26,10800,10900,11000,10700,63039,2019,6,26,2019,2019-06,266 days